Ran Plan for project: `github/springboot-sample` dir: `github/springboot-sample` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.sops_file.springboot_sample: Reading...
data.sops_file.springboot_sample: Read complete after 0s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.springboot_sample_assume_iam_role.github_actions_secret.secret will be created
+ resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "springboot-sample"
      + secret_name     = "ASSUME_IAM_ROLE"
      + updated_at      = (known after apply)
    }

  # module.springboot_sample_aws_account_num.github_actions_secret.secret will be created
+ resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "springboot-sample"
      + secret_name     = "AWS_ACCOUNT_NUM"
      + updated_at      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p github/springboot-sample`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fgithub%252Fspringboot-sample%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p github/springboot-sample`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
